@scotttyso Yes, on the bulk_mo_merger to actually do the updating of the policies if a profile needs to be changed to match a different template or updating on policy change. 

The src_template is needed to reflect the proper "linked" template in the gui. Simply updating the moid value returns a 403 error that the profiles is already associated to a template from my testing.

I am more than happy to discuss on call, maybe my work flow is wrong or I am not understanding something right.

I change the template referenced the mo_merger is triggered but fails on the updating of the src_template value.
----------------------------------------------------------------------------------------

Terraform will perform the following actions:

  # intersight_bulk_mo_merger.merge["pwd2n1"] will be created
  + resource "intersight_bulk_mo_merger" "merge" {
      + account_moid         = (known after apply)
      + ancestors            = (known after apply)
      + class_id             = "bulk.MoMerger"
      + create_time          = (known after apply)
      + domain_group_moid    = (known after apply)
      + id                   = (known after apply)
      + merge_action         = "Replace"
      + mod_time             = (known after apply)
      + moid                 = (known after apply)
      + object_type          = "bulk.MoMerger"
      + organization         = (known after apply)
      + owners               = (known after apply)
      + parent               = (known after apply)
      + permission_resources = (known after apply)
      + responses            = (known after apply)
      + shared_scope         = (known after apply)
      + sources              = [
          + {
              + account_moid         = (known after apply)
              + ancestors            = (known after apply)
              + class_id             = (known after apply)
              + create_time          = (known after apply)
              + domain_group_moid    = (known after apply)
              + mod_time             = (known after apply)
              + moid                 = "6573d55177696e33017d485c"
              + object_type          = "server.ProfileTemplate"
              + owners               = (known after apply)
              + parent               = (known after apply)
              + permission_resources = (known after apply)
              + shared_scope         = (known after apply)
              + tags                 = (known after apply)
              + version_context      = (known after apply)
            },
        ]
      + tags                 = (known after apply)
      + target_config        = (known after apply)
      + targets              = [
          + {
              + account_moid         = (known after apply)
              + ancestors            = (known after apply)
              + class_id             = (known after apply)
              + create_time          = (known after apply)
              + domain_group_moid    = (known after apply)
              + mod_time             = (known after apply)
              + moid                 = "659f70e977696e330180e5c9"
              + object_type          = "server.Profile"
              + owners               = (known after apply)
              + parent               = (known after apply)
              + permission_resources = (known after apply)
              + shared_scope         = (known after apply)
              + tags                 = (known after apply)
              + version_context      = (known after apply)
            },
        ]
      + version_context      = (known after apply)
    }

  # intersight_server_profile.server_profile["pwd2n1"] will be updated in-place
  ~ resource "intersight_server_profile" "server_profile" {
        id                                    = "659f70e977696e330180e5c9"
        name                                  = "pwd2n1"
      ~ src_template                          = [
          ~ {
              ~ moid                  = "6573d8c577696e33017d70e8" -> "6573d55177696e33017d485c"
                # (4 unchanged attributes hidden)
            },
        ]
        tags                                  = []
        # (45 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
intersight_server_profile.server_profile["pwd2n1"]: Modifying... [id=659f70e977696e330180e5c9]
╷
│ Error: error occurred while updating ServerProfile: 403 Forbidden Response from endpoint: {"code":"InvalidRequest","message":"Server profile already attached to a profile template. Cannot apply changes from other sources.","messageId":"gershwin_derived_sp_invalid_src","traceId":"cpXVm1KRWEbUHnFXcgb87wk-ZFYOiDr66hjoJX161H6WKw_A1a0D_Q=="}
│
│   with intersight_server_profile.server_profile["pwd2n1"],
│   on serivce_profiles.tf line 85, in resource "intersight_server_profile" "server_profile":
│   85: resource "intersight_server_profile" "server_profile" {
│
╵
